// ================================================================================================
//! \file       Signals.h
//! \brief      
//! \author     sunyanjun
//! \version    1.0.0
//! \date       2017Äê5ÔÂ2ÈÕ
//! \copyright  SANTROLL.
// ================================================================================================

#ifndef _SIGNALS_H_
#define _SIGNALS_H_

//! @defgroup SIGNALS SIGNALS
//! @{

#ifdef __cplusplus
extern "C" {
#endif
// ================================================================================================


// ================================================================================================
// the includes


// ================================================================================================
// the defines


// ================================================================================================
// the typedefs


// ================================================================================================
// the globals


// ================================================================================================
// the function prototypes

extern void SignalSamp(void);
extern void VoltsSampLoop(void);
extern void VoltsSampISR(void);
extern void SWI_Samp(void);
extern void KSI_Samp(void);
extern void MotTempSamp(void);
extern void InvTempSamp(void);
// ================================================================================================
#ifdef __cplusplus
}
#endif // extern "C"

//! @} // end of SIGNALS

#endif // end of _SIGNALS_H_
