/*
 * MotParm_Rmeax1000Nm.h
 *
 *  Created on: 2022年7月28日
 *      Author: liuxujie
 */

#ifndef SW_CONFIG_MOTPARM_RMEAX1000NM_H_
#define SW_CONFIG_MOTPARM_RMEAX1000NM_H_

#define ELECZERO            1080       //!< 电机旋变零点，
#define CURBASE   (2360 * SQRT2)       //!< 电流基值(峰值)*0.1A
#define VOLTBASE            7000       //!< 电压基值*0.1V
#define SPEEDBASE           5000       //!< 转速基值
#define IF                  3163       //!< 等效励磁电流*0.1A(峰值)
#define BEMF                1292       //!< 1000rpm反电势对应的电压 *0.1V
#define MOTPOLEPAIRS        10         //!< 电机极对数#
#define ENCODERPOLEPAIRS    5          //!< 旋变极对数#
#define SWAPENCODERDIR      0          //!< 旋变方向换向
#define SWAPPHASE           1          //!< 电机相线换向
#define MTPA_K3             1.5174     //!< MTPA拟合3次方系数#
#define MTPA_K2             (-3.4080)  //!< MTPA拟合2次方系数#
#define MTPA_K1             2.6804     //!< MTPA拟合1次方系数#
#define MTPA_K0             0.0195     //!< MTPA拟合0次方系数#
#define PEAKPOWER           0          //!< 输出机械功率限制 ，0.1Kw,0=不限制
#define PEAKTORQUE          0          //!< 输出扭矩限制，  NM,0=不限制

#define PWM_LOW_FREQ        2000       //!< 低频，2K
#define PWM_HIGH_FREQ       5100       //!< 高频，5k 高低相等不变频
#define PWM_LOW_FREQ_HZ     2          //!< 低频，电机Hz
#define PWM_HIGH_FREQ_HZ    10         //!< 高频，电机Hz 高低相等不变频

#define KP_ID               500       //!< D轴Kp参数*0.001
#define KI_ID               1000       //!< D轴Ki参数*0.0001
#define KP_IQ               600       //!< Q轴Kp参数*0.001
#define KI_IQ               1000       //!< Q轴Ki参数*0.0001
#define KP_FW1              250        //!< IdWeak_Kp参数*0.001
#define KI_FW1              58         //!< IdWeak_Ki参数*0.0001
#define KP_FW2              62         //!< AngleWeak_Kp参数*0.001
#define KI_FW2              15         //!< AngleWeak_Ki参数*0.0001
#define FW1_REF             1.05       //!< IdWeak参考
#define FW2_REF             1.05       //!< AngleWeak参考
#define UDMAX               1.4        //!< D轴电压最大值
#define UQMAX               1.4        //!< Q轴电压最大值

#define DCOVERCUR           5000       //!< 母线过流       0.1A
#define ACOVERCUR1          5000       //!< 相线过流1 0.1A(峰值)
#define ACOVERCUR2          5500       //!< 相线过流2 0.1A(峰值)
#define DCOVERVOLT3         7800       //!< 电压过压3 0.1V
#define DCOVERVOLT2         7500       //!< 电压过压2 0.1V
#define DCOVERVOLT1         7200       //!< 电压过压1 0.1V
#define DCUNDERVOLT1        2000       //!< 电压欠压1 0.1V
#define DCUNDERVOLT2        1500       //!< 电压欠压2 0.1V
#define DCUNDERVOLT3         300       //!< 电压欠压3 0.1V

#define OVERSPD1            5200       //!< 超速1转速
#define OVERSPD2            8000       //!< 超速2转速
#define KP_SPDLIMIT         4000       //!< 限速Kp参数*0.001
#define KI_SPDLIMIT         200        //!< 限速Ki参数*0.0001

#define DIRVECURLIMIT       5000       //!< 驱动母线电流限制*0.1A
#define BRAKECURLIMIT       5000       //!< 制动母线电流限制*0.1A
#define KP_IDCLIMIT         500        //!< 母线限流Kp参数*0.001
#define KI_IDCLIMIT         100        //!< 母线限流Ki参数*0.0001


#define KP_SPDM0            8000       //!< 速度模式0Kp参数*0.001
#define KI_SPDM0            200        //!< 速度模式0Ki参数*0.0001
#define KP_SPDM1            1000       //!< 速度模式1Kp参数*0.001
#define KI_SPDM1            100        //!< 速度模式1Ki参数*0.0001
#define KP_SPDM2            1000       //!< 速度模式2Kp参数*0.001
#define KI_SPDM2            100        //!< 速度模式2Ki参数*0.0001

#define PT100_1             0          //!< PT100_1 0==>没有
#define PT100_2             0          //!< PT100_2 0==>没有

#define TABNSTART           600       //!< 电机特性表中转速起始值rpm
#define TABNEND             4000       //!< 电机特性表中转速最高值rpm
#define TABNNUM             18         //!< 电机特性表中转速点数
#define TABNREFU            1500       //!< 测定特性表时的电压0.1V
#define TABNREFCUR     (3000 * SQRT2)  //!< 测点特性表时的电流0.1A
#define TABYNUM             11         //!< 特性表二维表列数


#define TM_TAB {508.0,490.0,406.0,334.7,278.0,238.0,206.0,181.3,159.6,142.0,\
                129.0,117.0,107.5, 99.0, 91.0, 83.6, 78.0, 73.0}

#define ISM_TAB {\
        1.0000, 1.0000, 1.0000, 0.9120, 0.8000, 0.7000, 0.6100, 0.5400, 0.4850, 0.4400, \
        0.4000, 0.3650, 0.3380, 0.3120, 0.2900, 0.2700, 0.2550, 0.2400}

#define TLIN_TAB  {\
        0.0000,0.1065,0.2036,0.2950,0.3857,0.4774,0.5708,0.6689,0.7720,0.8816,1.0000,\
        0.0000,0.1031,0.1969,0.2871,0.3750,0.4648,0.5566,0.6500,0.7500,0.8619,1.0000,\
        0.0000,0.0869,0.1673,0.2472,0.3302,0.4181,0.5086,0.6058,0.7141,0.8380,1.0000,\
        0.0000,0.0826,0.1653,0.2483,0.3311,0.4132,0.4959,0.5837,0.6804,0.7951,1.0000,\
        0.0000,0.0662,0.1368,0.2124,0.2904,0.3709,0.4556,0.5453,0.6438,0.7629,1.0000,\
        0.0000,0.0601,0.1226,0.1898,0.2623,0.3420,0.4289,0.5192,0.6215,0.7475,1.0000,\
        0.0000,0.0549,0.1117,0.1771,0.2496,0.3280,0.4117,0.5046,0.6105,0.7397,1.0000,\
        0.0000,0.0548,0.1106,0.1712,0.2393,0.3158,0.3990,0.4943,0.6010,0.7372,1.0000,\
        0.0000,0.0499,0.0997,0.1611,0.2270,0.3010,0.3846,0.4789,0.5879,0.7246,1.0000,\
        0.0000,0.0490,0.0979,0.1567,0.2193,0.2914,0.3744,0.4683,0.5738,0.7100,1.0000,\
        0.0000,0.0489,0.0977,0.1557,0.2165,0.2851,0.3669,0.4617,0.5714,0.7087,1.0000,\
        0.0000,0.0468,0.0936,0.1488,0.2068,0.2795,0.3609,0.4543,0.5627,0.7050,1.0000,\
        0.0000,0.0467,0.0935,0.1487,0.2067,0.2783,0.3595,0.4523,0.5636,0.6993,1.0000,\
        0.0000,0.0495,0.0990,0.1519,0.2066,0.2788,0.3603,0.4530,0.5650,0.7151,1.0000,\
        0.0000,0.0455,0.0910,0.1471,0.2067,0.2741,0.3533,0.4420,0.5508,0.6983,1.0000,\
        0.0000,0.0464,0.0929,0.1495,0.2090,0.2748,0.3516,0.4419,0.5512,0.6900,1.0000,\
        0.0000,0.0473,0.0945,0.1493,0.2057,0.2691,0.3435,0.4338,0.5429,0.6894,1.0000,\
        0.0000,0.0456,0.0912,0.1454,0.2020,0.2750,0.3511,0.4380,0.5483,0.6894,1.0000}
// ================================================================================================
// the typedefs


// ================================================================================================
// the globals


// ================================================================================================
// the function prototypes






#endif /* SW_CONFIG_MOTPARM_RMEAX1000NM_H_ */
